Autodesk.Revit.DB.ExternalDefinitionCreationOptions.SetDataType(Autodesk.Revit.DB.ForgeTypeId)
Sets the parameter's data type.
dataType:
The identifier of either a spec or a category.
A category identifier indicates a Family Type parameter of that category.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given identifier is neither a spec nor a category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ExternalDefinitionCreationOptions.GetDataType
Gets the identifier describing the parameter's data type.
The identifier may belong to either a spec or a category.
If it is a category, the parameter is a Family Type parameter of that
category.
Since:
2015

Autodesk.Revit.DB.ExternalDefinitionCreationOptions.HideWhenNoValue
This property indicates whether this parameter should be hidden from the properties palette
when it doesn't have a value.
True if the parameter should be hidden when it has no value, False if the parameter should
remain visible in the properties palette even when it doesn't have a value.
The default is false
Since:
2020

Autodesk.Revit.DB.ExternalDefinitionCreationOptions.Description
The description of the parameter definition to be created. The description will be used as tooltip in the
Revit UI including in the properties palette.
The default is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ExternalDefinitionCreationOptions.Name
The name of the parameter definition to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ExternalDefinitionCreationOptions.#ctor(System.String,Autodesk.Revit.DB.ForgeTypeId)
Constructs the options using a specified name and type.
name:
The name of the parameter definition to be created.
dataType:
The identifier of either a spec or a category.
A category identifier indicates a Family Type parameter of that category.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given identifier is neither a spec nor a category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015